/***************************************************************************//**
  * @file    stm32f0xx_it.h 
  * @author  吴国炎
  * @version V1.0.0
  * @date    2012年8月16号
  * @brief   中断服务函数头文件
*******************************************************************************/
 

/* 防止重定义-----------------------------------------------------------------*/
#ifndef __STM32F0XX_IT_H
#define __STM32F0XX_IT_H

#ifdef __cplusplus
 extern "C" {
#endif 

/* 包含头文件 *****************************************************************/
#include "stm32f0xx.h"

/* 导出的类型定义-------------------------------------------------------------*/
/* 导出的宏定义 --------------------------------------------------------------*/
/* 导出的变量声明 ------------------------------------------------------------*/
/* 导出的函数声明 ------------------------------------------------------------*/

void NMI_Handler(void);
void HardFault_Handler(void);
void SVC_Handler(void);
void PendSV_Handler(void);
void SysTick_Handler(void);

#ifdef __cplusplus
}
#endif

#endif /* __STM32F0XX_IT_H */

/******************* (C) COPYRIGHT wuguoyana ***************文件结束***********/
